<?xml version="1.0" encoding="iso-8859-1"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN" "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Solaufeins Rettung - jasteys Solaufein NPC mod f&uuml;r BGII</title>
<meta http-equiv="Content-Type" content="text/html; charset=iso-8859-1" />
<link href="readme/bgreadme.css" type="text/css" rel="stylesheet" />
</head>
<body>

<table border="0" width="100%" cellpadding="0" cellspacing="0" align="center">
<tr>
	<td align="center"><a href="https://www.baldurs-gate.de/index.php"><img src="readme/BannerSword.png" border="0" alt="Baldur's Gate Forum" /></a></td>
	<td align="right">
		&nbsp;
	</td>
</tr>

</table>
<h1>Solaufeins Rettung - jasteys Solaufein NPC mod f&uuml;r BGII</h1>
<div class="section"> 
  <p><strong><a href="https://www.baldurs-gate.de/index.php">A Kerzenburgforum-Modifikation</a><br />  </strong>
    Text und Coding: jastey<br />
	Portraits: <a href="https://chinasky.artstation.com/">Holger Kirste</a><br />
    <strong> Sprachen:</strong> Englisch, Deutsch<br />
    <strong>Betriebssysteme: </strong>Windows, OSX, Linux</p> 
  <p>Solaufeins Rettung ist eine Quest- und NSC Mod f&uuml;r BGII. Direkt kompatibel mit BGII, BGT, BGII:EE und EET.</p>
    <img src="readme/SolauDefault.png">
</div>


<h2>Inhalt</h2>
<div class="section">
  <ol>
    <li><a href="#install">Installation</a></li>
      <ul> 
		<li><a href="#eegames">Hinweise zum Modden der EE-Spiele</a> </li>
        <li><a href="#windows">Windows</a> </li>
		<li><a href="#osx">Mac OS X</a> </li>
		<li><a href="#linux">Linux</a> </li>
      </ul> 
    <li><a href="#compat">Kompatiblit&auml;t mit anderen Mods und Installationsreihenfolge</a>
      <ul> 
		<li><a href="#compatgeneral">Generelles</a> </li>
        <li><a href="#compatweimer">Kompatiblit&auml;t mit Weimers Solaufein</a></li>
      </ul> 
    </li> 	
    <li><a href="#content">Beschreibung</a>
      <ul> 
		<li><a href="#generalcontent">Generelles</a> </li>
        <li><a href="#note">Bitte beachten</a> </li>
		<li><a href="#details">Details</a> </li>
		<li><a href="#content">Inhalt</a> </li>
		<li><a href="#7th">Solaufein als 7.Gruppenmitglied</a> </li>
		<li><a href="#stats">Solaufeins Eigenschaften und Portrait</a> </li>
		<li><a href="#character">Solaufeins Charakter</a> </li>
      </ul> 
    </li> 
    <li><a href="#issues">Bekannte Probleme</a></li> 
    <li><a href="#acknow">Danksagungen</a></li> 	
    <li><a href="#tools">Verwendete Tools</a>
      <ul> 
		<li><a href="#communities">Modding Communitys, Tutorials und technische Unterst&uuml;tzung</a> </li>
        <li><a href="#links">Weitere Links von verwendeten oder n&ouml;tigen Ressourcen</a> </li>
      </ul> 
    </li> 	
    <li><a href="#credit">Copyright and Legal Notice</a></li>
    <li><a href="#version">Versionshistorie</a> </li> 
  </ol> 
</div> 

<h1><a name="install" id="install">Installation</a></h1>
<div class="section">

HINWEIS: Wenn Ihr eine vorherige Version der Mod installiert habt, muss diese erst vollst&auml;ndig entfernt werden. Daf&uuml;r wird diese fr&uuml;here Version vollst&auml;ndig deinstalliert und alle Ressourcen (Modordner, Installationsprogramm) aus dem Spielordner entfernt. 
<br />
<br />
Das Spiel darf w&auml;hrend der Installation nicht bereits laufen.<br />
<br />
Bei Installation oder Uninstallation darf das Installationsfenster NICHT &uuml;ber Dr&uuml;cken des "X"-Kn&ouml;pfchens beendet werden. Das Schlie&szlig;en des Installationsfensters erfolgt &uuml;ber das Dr&uuml;cken der ENTER-Taste, wenn dazu die Aufforderung erscheint.<br />


<h2> <a name="eegames" id="quest">Hinweise zum Modden der EE-Spiele</a></h2>
Bei den Spielen der Enhanced Edition ist es wichtig, dass die Mod in die richtige Spiel-Sprachversion installiert wird (damit ist die Sprache gemeint, in der Ihr das Spiel spielen wollt, diese ist nicht von der Sprache, in der Ihr die Mod installieren wollt, abh&auml;ngig). Ansonsten seht Ihr nicht die Modtexte im Spiel, sondern Fehlermeldungen. Die Spiel-Sprache, die gemoddet wird, ist in der Datei weidu.conf in Eurem Spielordner vermerkt. Wenn Ihr die Spiel-Sprache, die gemoddet werden soll, &auml;ndern wollt, dann deinstalliert alle Mods und l&ouml;scht die Datei weidu.conf. Bei der Installation der n&auml;chsten (ersten) Mod wird die zu verwendende Spiel-Sprache dann wieder abgefragt.<br />
<br />

Die EE-Spiele sind aktiv supportete Spiele, f&uuml;r die es ab und zu Patchupdates gibt. Bitte bedenkt, dass jedes Spielupdate Eure Spieldaten wieder bereinigt! Wenn Ihr gerade ein gemoddetes Spiel spielt, dann k&ouml;nnt Ihr nach einem Spielpatch Eure Savegames nicht mehr verwenden. Eine M&ouml;glichkeit, dies zu verhindern ist es, den gesamten Spieleordner vor dem Modden in ein anderes Verzeichnis zu kopieren. Dieses Spiel kann dann unabh&auml;ngig gemoddet und &uuml;ber die BGMain.exe direkt gestartet werden. 
<h2> <a name="windows" id="quest">Windows</a></h2>
Entpackt den Ordner "c#solaufein" und die "setup-c#solaufein.exe" in Euer Spielverzeichnis (BG2/BGT/BGII:EE/EET, enth&auml;lt die CHITIN.KEY Datei). Bei erfolgreichem Entpacken solltet Ihr einen Ordner "c#solaufein" und eine ausf&uuml;hrbare Datei "setup-c#solaufein.exe" in Eurem Spielordner vorfinden. Lasst die "setup-c#solaufein.exe" &uuml;ber Doppelklick laufen. W&auml;hlt Eure Sprache und best&auml;tigt die Installation. Es sollten nun alle ben&ouml;tigten Dateien kopiert und die Installation durchgef&uuml;hrt werden. Das Installationsfenster durch das Dr&uuml;cken der ENTER-Taste schlie&szlig;en, wenn die Aufforderung dazu erscheint.<br />
<br />
&Uuml;ber erneutes Laufenlassen der setup-c#solaufein.exe in Eurem Spielordner kann die Mod auch deinstalliert oder die Portraitauswahl ver&auml;ndert werden.<br />
<h2> <a name="osx" id="quest">Mac OS X</a></h2>
Entpackt den Inhalt des Modpakets und kopiert den Inhalt in Euer Spieleordner (BG2/BGT/BGII:EE/EET, enth&auml;lt die CHITIN.KEY Datei). Korrekt extrahiert, sollten sich in Eurem Spiel-Hauptverzeichnis ein Ordner "c#solaufein" und dei Dateien setup-c#solaufein und setup-c#solaufein.command befinden. Zum Installieren einfach die setup-c#solaufein.command doppelklicken und den Instruktionen folgen. Das Installationsfenster durch das Dr&uuml;cken der ENTER-Taste schlie&szlig;en, wenn die Aufforderung dazu erscheint.<br />
<br />
&Uuml;ber erneutes Laufenlassen der setup-c#solaufein.command in Eurem Spielordner kann die Mod auch deinstalliert oder die Portraitauswahl ver&auml;ndert werden.<br />
<h2> <a name="linux" id="quest">Linux</a></h2>
Entpackt den Inhalt des Modpakets und kopiert den Inhalt in Euer Spieleordner (BG2/BGT/BGII:EE/EET, enth&auml;lt die CHITIN.KEY Datei). Ladet die neueste Version von WeiDU f&uuml;r Linux von https://github.com/WeiDUorg/weidu/releases und kopiert WeiDU und WeInstall nach /usr/bin. &Ouml;ffnet nun ein Terminal, cd zu Eurem BG Installationsordner, und lasst 'tolower' laufen, mit der Antwort Y auf beide Nachfragen. Die zweite Option (linux.ini) k&ouml;nnt Ihr auslassen, wenn Ihr dies bereits einmal in Eurem Verzeichnis ausgef&uuml;hrt habt. Falls Ihr Euch nicht sicher seid, ist das Ausf&uuml;hren von tolower mit beiden Optionen der sichere Weg.<br />
<br />
Lasst WeInstall c#solaufein in Eurem Spielordner laufen, um die Modifikation zu installieren. F&uuml;hrt wine BGMain.exe aus, um das Spiel zu starten.<br />

</div>

<h1><a name="compat" id="compat">Kompatiblit&auml;t mit anderen Mods und Installationsreihenfolge</a></h1>
<div class="section">
<h2> <a name="compatgeneral" id="generalcontent">General</a></h2>
Solaufeins Rettung - jasteys Solaufein NPC Mod f&uuml;r BGII wurde mit WeiDU programmiert (weitere verwendete Tools s. unten), und sollte daher mit den meisten WeiDU-Mods kompatibel sein. <br />
<br />
Die Mod ist mit Imoen 4 Ever kompatibel.<br />
<br />
F&uuml;r BGII / BGT installiert Ihr bitte die Basiskomponente ("Core Mod") von "Infinity Animations", um die Drinnen-Animation in Eurem Spiel zu sehen.
<br />
<br />
Die Mod enth&auml;lt Crossmodinhalte. Die Hauptkomponente von Solaufeins Rettung - jasteys Solaufein NPC f&uuml;r BGII sollte nach folgenden Mods installiert werden:
-Lavas Eilistraee's Song: installiert Solaufein's Rescue nach Eilistraee's Song, um die beiden Mods komplett kompatibel zu machen.<br />
Die 5. Komponente "Detektion fuer Drow HC" sollte nach den folgenden Mods installiert werden (falls HC Drow sein soll):<br />
-Corsymyr's BG:EE Subrace Mod <br />
-FinnJO's Subrace Mod<br /> 
-tipun's Subrace mod<br />
-Welverin's Subrace Mod.<br />
<br />
Aller weiterer Crossmod befindet sich ab Version 1.5 im <a href="https://www.gibberlings3.net/mods/npcs/crossmod/">Crossmod Banter Pack.</a>
<br />

<h2><a name="compatweimer" id="compatweimer">Kompatiblit&auml;t mit Weimers Solaufein</a></h2>
Wenn beide Solaufein-Mods installiert sind, wird die Weimer-Mod von Solaufeins Rettung folgendermaßen ber&uuml;cksichtigt. Die Idee dabei ist, es Spielern zu erm&ouml;glichen, die Rettungsquest zu spielen, aber trotzdem danach Weimers Solaufein in die Gruppe aufnehmen zu können, wenn Euch Weimers Charakterisierung von Solaufein besser zusagt. Dies sollte so fl&uuml;ssig und möglichst ohne Immersionsbruch möglich sein.<br />
An Weimers Solaufein f&uuml;hrt meine Modifikation keine &Auml;nderung durch.<br />
<br />
Weimers Solaufein tritt als erstes auf den HC zu, wenn die Gruppe nach der Zeremonie die Drowstadt verl&auml;sst. Wenn Ihr den Resttungsquest meiner Mod spielen wollt, m&uuml;sst Ihr Weimers Solaufein nun alleine zur Oberfl&auml;che schicken. Die Queste "Solaufeins Rettung" startet nur, wenn Weimers Solaufein bei der ersten Begegnung vor der Drowstadt nicht mehr in der Gegend ist, also weder in die Gruppe aufgenommen wurde noch im Unterreich wartet. Weimrs Solaufein kann auch komplett weggeschickt werden. De STart meiner Mod ist davon nicht beeinflusst.<br />
<br />
Nach der Queste mit Solaufeins Befreiung aus den Drinnekammern kann man meinem Solaufein sagen, dass man ihn so erwartet "wie urspr&uuml;nglich vereinbart", was dazu f&uuml;hrt, dass mein Solaufein *nicht* auftaucht sondern nur Weimers Solaufein an der Oberfl&auml;che wartet.<br />
<br />
Mein Solaufein wird nur dann sp&auml;ter zur Gruppe sto&szlig;en, wenn man die Antwortoption w&auml;hlt, dass ihn die Erfahrung in den Drinnenkammer ver&auml;ndert habe, und man ihn so (ver&auml;ndert) haben m&ouml;chte. Das Erscheinen von Weimers Solaufein wird hiervon nicht ver&auml;ndert.<br />
<br />

An der Oberfl&auml;che stehen, sofern beide Mods installiert und "beide" Solaufeins vorgeschickt wurden, beide Solaufeins herum. Meiner steht in der s&uuml;d&ouml;stlichen Ecke des Elfenwaldes, weit genug von Weimers Solaufein weg (Koordinaten [2477.2023]).<br />
<br />
Damit die Modkomponente "Solaufein in Ust Natha das Mod-Portrait geben" Wirkung zeigt und das Portrait aus diesem Mod dem Original-Solaufein zugewiesen wurde, muss diese Komponente nach der Weimer Mod installiert werden. <br />
</div>

<h1><a name="content" id="content">Beschreibung</a></h1>
<div class="section">
<h2> <a name="generalcontent" id="generalcontent">Generelles</a></h2>
Die Modifikation macht Solaufein, den Drow Krieger aus Ust Natha, zu einem in die Gruppe aufnehmbaren NPC. Vorher muss Solaufein aus den Drinnenkammern befreit werden. Dieser Quest kann unabh&auml;ngig davon gespielt werden, ob Solaufein in die Gruppe aufgenommen werden soll, oder nicht. <br />
<br />
Die Kompatibilit&auml;t mit Weimers Solaufein wird in dieser Liesmich ausf&uuml;hrlich behandelt, sofern Ihr Euch beim Spielen die Wahl lassen wollt.<br />
Die Mod erm&ouml;glicht es, bei voller Gruppenst&auml;rke Solaufein als "7. Gruppenmitglied" mitzunehmen. Hierzu steht unten mehr.<br />
<br />
Die zweite, optionale Komponente bietet die M&ouml;glichkeit, dem Spiel-Solaufein in Ust Natha das Mod-Portrait zuzuweisen (hierzu Installationsreihenfolge bzgl. Kompatibilit&auml;t mit Weimers Solaufein beachten).<br />
<br />
Die dritte, optionale Komponente bietet f&uuml;r BGII/BGT die M&ouml;glichkeit, bei installierter Hauptkomponente von Infinity Animations (Link s.u. "LINKS") die Drideranimationen f&uuml;r die Mod zu verwenden. Die Drinnenanimationen werden durch die Solaufein Mod zur Verf&uuml;gung gestellt. Ist Infinity Animations nicht vorhanden, werden die Drinnen im Spiel mit Drow ersetzt. Eine Beeintr&auml;chtigung beim Spielen besteht nicht (au&szlig;er, dass es nicht so sch&ouml;n aussieht. ;-) ) <br />
Die Komponente kann nachtr&auml;glich nach der Installation von Infinity Animations installiert werden, so dass die Installationsreihenfolge der Hauptkomponente unabh&auml;ngig ist. <br />
F&uuml;r BGII:EE und EET werden die Animationen immer installiert, und diese Komponente wird automatisch &uuml;bersprungen.<br />
<br />
Die vierte, optionale Komponente bietet die M&ouml;glichkeit, das alternative Portrait f&uuml;r Solaufein zu installieren, ebenfalls von Holger Kirste!<br />
<br />
Die f&uuml;nfte, optionale Komponente erm&ouml;glicht es, dass Solaufein den HC als Drow erkennt, wenn Ihr als Drow spielt. Hierzu wird im Spiel dann eine Variable gesetzt. Die Komponente funktioniert folgendermaßen:<br /> 
Wenn keine Subrace Mod erkannt wird, wird eine Abtwortoption zu Adalons Dialog eingef&uuml;gt, mit dem ein Elfen-HC sagen kann, dass er oder sie ein Drow ist. Dies kann leicht immersionsbrechend sein, wenn Ihr nicht als Drow spielt. W&auml;hlt diese Antwortoption, damit Solaufein Euren HC als Drow erkennt.<br />
Mit installierter Subrace Mod erfolgt die Detektion automatisch, wenn die 5. Komponente nach der Subrace Mod installiert wird. Die ber&uuml;cksichtigten Subrace Mods sind die folgenden:<br />
-Corsymyr's BG:EE Subrace Mod<br />
-FinnJO's Subrace Mod<br /> 
-tipun's Subrace Mod<br />
-Welverin's Subrace Mod.<br />

<h2> <a name="note" id="note">Bitte beachten</a></h2>
Die Mod muss vor dem ersten Besuch des Unterreichs installiert werden. Das liegt daran, dass am Haupt-Gebiet &Auml;nderungen vorgenommen werden, die sonst nicht mehr angezeigt werden.<br />
<br />
Solaufein schlie&szlig;t sich nicht einem HC b&ouml;ser Gesinung an, dessen Ruf unter 10 ist. Dies ist darin geschuldet, dass mein Freundschaftspfad wirklich nur f&uuml;r nicht-b&ouml;se HCs Sinn macht, und ich keinen Dialogpfad f&uuml;r b&ouml;se HCs schreiben wollte. Ich denke auch, dass Solaufeins Begr&uuml;ndung durchaus seinem Charakter entspricht: "Nein. Eure Gesinnung ist kein Geheimnis. Auch wenn Ihr mir bis hierher geholfen habt, steht Ihr f&uuml;r das, was ich versuche, hinter mir zu lassen.".<br />

<h2> <a name="details" id="details">Details</a></h2>
Die Mod startet, nachdem die Gruppe nach der D&auml;monenbeschw&ouml;rung zum letzten Mal die Drowstadt verl&auml;sst. Solaufein muss (logisch) verschont worden sein. (Kompatibilit&auml;t mit Weimers Solaufein s.o.)<br />
<br />
Vor dem Eingang zu Adalons H&ouml;hle f&auml;ngt Solaufein die Gruppe noch einmal ab - dabei wird er leider von anderen Drow aufgesp&uuml;rt und als Verr&auml;ter gefangen genommen. Es ist nun an dem HC, Solaufein davor zu bewahren, in eine Drinne verwandelt zu werden!<br />
<br />
Nach der Befreiung aus den Drinnenkammern will Solaufein noch ein paar Gegenst&auml;nde einsammeln. Er kann dann beim Verlassen des Unterreichs (vorher oder nachher) in die Gruppe aufgenommen werden.
<br />
<br />
Wenn Ihr ein neues Spiel im TdB-Teil startet und Solaufein in der H&ouml;llenenklave erschafft, k&ouml;nnt Ihr im Begr&uuml;&szlig;ungsdialog w&auml;hlen, ob er Euren HC bereits in Amn begleitet hat (bestehende Freundschaft: Solaufein ist bereits mit dem HC vertraut) oder nach der Befreiung aus der Drinnenkammer getrennte Wege ging (hierbei werden die Freundschaftsdialoge aus dem SvA-Teil mit leichten Anpassungen gestartet! Diese Option solltet Ihr nur w&auml;hlen, wenn Ihr nicht vorhabt, einen BGII-Durchlauf mit Solaufein zu spielen, da dort der Freundschaftspfad einfach besser passt, m.M.n.). Es wird beim Start im TdB-Teil immer angenommen, dass der HC ihn aus der Drinnenkammer befreit hatte.<br />

<h2> <a name="content" id="content">Inhalt</a></h2>
Queste "Solaufeins Rettung": F&uuml;gt Drinnenkammern in das Unterreich ein (zu betreten vom westlichen Kartenrand, n&ouml;rdlich der Stelle, an dem die Gruppe das erste mal landet (hinter der Gruppe Illithiden)).<br />
<br />
Solaufein als vollst&auml;ndig ausgearbeiteter aufnehmbarer NPC: Freundschaftspfad (26 zyklische Dialoge), NPC-Banter (mind. 2 in SvA und 1 in ToB mit jedem BioWare und BeamDog NPC), zus&auml;tzliche szenerieabh&auml;ngige Dialoge und Bemerkungen, Einmischdialoge (nur) an den &uuml;blichen Stellen, PID mit mehreren vollst&auml;ndigen Dialogen.<br />
<br />
Es gibt in Atkatla eine Begegnung mit zwei nachfolgenden Begegnungen, die letzte in TdB (Amkethran). Dies eine Quest zu nennen w&auml;re höchst &uuml;bertrieben. Der HC kann daf&uuml;r auch die Waffen stecken lassen.<br />
<br />
Solaufein reagiert darauf, wenn der HC ein Drow ist. (Er steht allerdings nicht zur Verf&uuml;gung, um Drowlore zu unterrichten.) Um ihn erkennen zu lassen, dass der HC ein Drow ist, muss die 5. Komponente der Solaufein Mod installiert sein. Dann erfolgt die Detektion entweder automatisch, wenn eine der Subrace Kit Mods vorher installiert wurde und der HC dar&uuml;ber zu einem Drow bzw. Halbdrow gemacht wird. Unterst&uuml;tzt werden: Welverin's Subrace Mod, FinnJO's Subrace Mod, Corsymyr's BG:EE Subrace Mod, tipun's Subrace Mod (bisher jeweils nur die englische Version, da keines der Mods andere Sprachversionen hat).<br />
Wenn keine Subrace Mod installiert wurde, dann f&uuml;gt die 5. Komponente f&uuml;r "handgemachte" Drow HCs eine spezielle Antwortoption in Adalons Dialog, bevor sie ihre Drowillusion wirkt. Diese wird f&uuml;r einen Elfen-HC angezeigt. Klickt diese Antwortoption nur an, wenn Euer HC von Solaufein als Drow angesprochen werden soll.<br />


<h2> <a name="7th" id="7th">Solaufein als 7.Gruppenmitglied</a></h2>
Wenn Ihr einen Gruppenslot f&uuml;r einen anderen NPC ben&ouml;tigt, dann kann Solaufein auch als sogenanntes "7. Gruppenmitglied" folgen. Hierf&uuml;r muss er normal aus der Gruppe geworfen werden. Wenn er dann fragt, was Ihr von ihm wollt, dann sagt ihm, dass er weiter hinten folgen soll. Vom Scripting her erh&auml;lt er dann einen &auml;hnlichenn Status wie ein Familiar, das hei&szlig;t er folgt dem HC bei Gebietswechseln &uuml;berall hin, leider auch in Traumsequenzen oder andere Cutscenes. Als 7. Gruppenmitglied kann Solaufein Befehle gegeben werden und es kann auf seine Quickslots und Zauber zugegriffen werden. Er muss normal in die Gruppe aufgenommen werden, um hochzuleveln oder um seine Items und Zauberslotbelegungen zu managen. Alle seine Dialoge, Banter und Einmischdialoge werden normal getriggert.<br />
<br />
Um ihn wieder normal in die Gruppe aufzunehmen, sprecht ihn an und w&auml;hlt in den PID-Optionen, dass Ihr Zugang zu seinem Inventar braucht. Dann wird Solaufein der Gruppe wieder als normales Mitglied beitreten. Wenn dies durch Dr&uuml;cken der Pausetaste entsprechend zeitlich optimiert wird, dann kann das Management seines Inventars und sein Aufsteigen so erledigt werden, dass ein anderer NPC daf&uuml;r nicht permanent aus der Gruppe entlassen werden muss, sondern dieser wieder in die Gruppe aufgenommen werden kann, wenn er seinen "Kickout"-Dialog startet.<br />
<br />
W&auml;hrend Solaufein als 7. Gruppenmitglied folgt, kann er nicht sterben, sondern verbleibt bei 1LP. Fallen seine LP in einem Kampf auf 1 LP dann f&auml;llt er in Ohnmacht und wird "neutral" (blauer Kreis), so dass Feinde ihn nicht weiter als Angriffsziel wahrnehmen. Ihn in diesem Zustand zu heilen &auml;ndert nichts daran, dass er au&szlig;er Gefecht gesetzt ist. Erst nach dem Kampf steht Solaufein wieder auf. Aus technischen Gr&uuml;nden wird er vollst&auml;ndig geheilt, bevor er wieder in den 7. Gruppenmitglieds-Modus wechselt. Dies hat mit der Spielengine zu tun und wie sie die LP der Gruppenmitglieder berechnet (Solaufein k&ouml;nnte sonst unter Umst&auml;nden an diesem Punkt sterben, wenn die HP zu niedrig sind, obwohl er eigentlich nicht tot war).<br />
<br />
Das Ohn&auml;chtigwerden im Kampf kann verhindert werden, indem Solaufein rechtzeitig geheilt wird. &Uuml;ber PID kann ihm gesagt werden, dass er warnen soll, bevor er diesen Punkt erreicht, dann wird das Spiel pausiert wenn Solaufein droht, zu wenig LP zu haben. Dies scheint in BGT aber nicht zu funktionieren.<br />
<br />
HINWEIS: Leider ben&ouml;tigt der "7. Gruppenmitglieds-Modus" im Spiel ein besonderes Handling, um alle Einschr&auml;nkungen zu ber&uuml;cksichtigen: 
(Die Hinweise sind eine Mischung aus den vorhandenen Enginerestriktionen und den von mir verwendeten Workarounds.)<br />
-Der NPC hat im 7.GM keinen "Clear Fog of War" um sich herum. Er kann also im "schwarzen" Bereich der Karte "verschwinden". (Wenn man die gesamte Gruppe anklickt und zu einer Stelle laufen l&auml;sst, wird er es ebenfalls versuchen, sofern er nicht irgendwo feststeckt o.&auml;. Dann hilft nur noch der Teleportationscheat "Strg+j" um die Gruppe wieder zu versammeln. Mir ist das so noch nicht geschehen, es ist aber theoretisch m&ouml;glich, wenn der NPC z.B. einen Feind verfolgt.)<br />
-Items im Inventar werden *nicht* als Items im Besitz der Gruppe erkannt. Dies ist ein Engineproblem. Daraus folgt, dass Questitems die im Spiel ben&ouml;tigt werden, nicht im Inventar des NPCs sein sollten, wenn sie vom Questgeber erkannt werden sollen. Beispiele: Elvenhaars Buch, Ankhegpanzer f&uuml;r Taerom etc.<br />
-Als "critical" getaggte Quest-Items werden beim Wechsel in den 7. GMM in das Inventar des HC verschoben. Dadurch landen eventuell Gegenst&auml;nde aus dem Inventar des HC auf dem Boden. Dies ist ein Engineproblem. Daraus ergibt sich, dass Ihr immer nach Wechsel des NPC in de 7.GMM nachschauen solltet, ob Items auf dem Boden gelandet sind!<br />
-Wenn bei einem meiner Quests speziell f&uuml;r diesen NPC neue Items &uuml;bergeben werden, erscheinen diese immer im Inventar der Gruppe bzw. HC, auch wenn sie eigentlich der NPC erhalten soll. Dies ist ein Engineproblem. Auch wenn ich es so gescriptet haben sollte, dass die Gegenst&auml;nde schlussendlich im Inventar des NPCs sind, werden sie trotzdem &uuml;ber das Inventar des HC geh&auml;ndelt. Wie sonst auch im Spiel k&ouml;nnen auch hierbei Gegenst&auml;nde aus dem Inventar auf dem Boden gelandet sein.<br />
-F&uuml;r meine NPCs habe ich versucht, bei den eigenen Questitems (auch wenn es sich um Originalitems des Spiels handelt, sofern sie f&uuml;r den Quest meines NPCs n&ouml;tig sind) diese auch im Inventar des NPC erkennen zu lassen. Das klappt mit folgenden Einschr&auml;nkungen:<br />
-- Alle Items, um die es geht, werden &uuml;ber das Inventar das HC geh&auml;ndelt bevor sie entweder einem Questgeber gegeben oder von diesem erhalten wurden. Das bedeutet, dass andere Items auf dem Boden gelandet sein k&ouml;nnten.<br />
-- Befand sich das weggebene Item in einem Nimmervollen Beutel (dazu z&auml;hle ich auch Edelsteinbeutel, Taschen f&uuml;r Flaschen etcpp.), dann wird das Item nicht entfernt. Es ist danach noch immer im Nimmervollen Beutel und kann Probleme bereiten, wenn der Quest nicht stabil gescriptet wurde (und davon ausgeht, dass das Item weg sein sollte).<br />
-- 2. Problem mit Items im Nimmevollen Beutel: Befand sich das weggebene Item in einem Nimmervollen Beutel, dann st&uuml;rt aus unerfindlichen Gr&uuml;nden das Spiel ab, wenn der NPC danach wieder &uuml;ber die PID-Option als vollwertiges Mitglied in die Gruppe aufgenommen werden soll. Dieser "Absturzbug" l&auml;sst sich umgehen, indem das Spiel gespeichert und wieder geladen wird.<br />
<br />
Nochmal in K&uuml;rze die wichtigsten Tips zusammengefast:<br />
-Nach jedem Questereignis und nach dem Wechsel in den 7.GMM nochmal schauen, ob der HC Items aus dem Inventar verloren hat, die wieder vom Boden aufgelesen werden sollten.<br />
-Speichern, bevor ein 7. GM wieder in die Gruppe aufgenommen werden soll. Sollte das Spiel dann abst&uuml;rzen, den Spielstand neu laden. Damit sollte der Absturz nicht auftreten.<br />
-Es ist n&ouml;tig und auch zu empfehlen, nicht-kritische Questitems nicht im Inventar der 7. GM sondern in dem der normalen Gruppenmitglieder zu haben.<br />
-Questitems aus Beuteln/Nimmervollen Taschen im Inventar des 7. GM nehmen, bevor man die entsprechenden Questgeber anspricht, um den "Absturzbug" zu verindern, oder auf alle F&auml;lle zu speichern, bevor man ihn wieder richtig in die Gruppe aufnimmt.<br />
<br />


<h2> <a name="stats" id="stats">Solaufeins Eigenschaften und Portrait</a></h2>
Solaufein ist rechtschaffen neutraler Gesinnung.<br />
<br />
 Die Mod gibt ihm das Kit "Drowk&auml;mpfer", mit den folgenden Eigenschaften:<br />
<br />
  Vorz&uuml;ge:<br />
  -Erh&auml;lt zus&auml;tzliche 2% magische Resistenz bei jedem Stufenaufstieg bis zu einem Maximum von 80% auf Stufe 16.<br />
  -Spezialf&auml;higkeiten: Feenfeuer, Dunkelheit, Dimensionstor, Magie Bannen je 1 / Tag
<br />
  <br />
  Nachteile:<br />
  -w&auml;hrend des Tages hat der Drowkrieger au&szlig;erhalb geschlossener R&auml;ume folgende Nachteile aufgrund des Sonnenlichts:<br />
  -Verschlechterung von EtW0 und R&uuml;stungsklasse um je 4<br />
  -Verschlechterung von EtW0 und R&uuml;stungsklasse um je 4<br />
  -Sichtweite reduziert auf 2<br />
  -Reduzierung der Magieresistenz um 50% (gez&auml;hlt von 100%)<br />
  <br />
Hierzu vielen herzlichen Dank an Knight, der mir erlaubt hat, seine Zauber "Feenzauber" und "Dunkelheit" aus seinem Knights Kits zu verwenden (zur Sicherheit habe ich alle Dateien umbenannt und mit meinem Pr&auml;fix versehen). Danke an Acifer f&uuml;r die Zaubergraphiken. Zum Teil habe ich mich f&uuml;r die Zauber auch an die in der Enhanced Edition erh&auml;ltlichen (SoD und BGII:EE) orientiert, so dass das Ergebnis eine Mischung ist.<br /><br />
Solaufeins hat folgende Eigenschaften:
      <ul> 
		<li>STR: 17</li>
		<li>DEX: 16</li>
		<li>CON: 15</li>
		<li>INT: 14</li>
		<li>WIS: 11</li>
		<li>CHA: 10</li>
      </ul> <br />
Upon first meeting, he is at level 12 and comes ill equipped with weapons and armor when he joins the group. His weapon pips when first meeting in the Underdark are:
      <ul> 
		<li>Long Sword: ++</li>
		<li>Scimitar: ++</li>
		<li>Sword and Shield Style: ++</li>
		<li>Two Weapon Style: ++</li>
      </ul> <br />
<br />
Solaufein verwendet ein Soundset, das aus seinen originalen vertonten Zeilen des Spieles erstellt wurde.<br />
<br />
Beide Portraits sind zwei Drowkrieger-Bildern von Holger Kirste entnommen, mit seiner Erlaubnis, daf&uuml;r vielen Dank!<br />
Es gibt ein alternatives Portraits, das &uuml;ber die vierte, optionale Komponente gew&auml;hlt werden kann, wobei das Standardportrait in der Hauptkomponente bereits enthalten ist:<br /><br />
<img src="readme/SolauDefault.png">
<img src="readme/SolauAlt.png"><br />
------- Standardportrait ------- ------- Alternative -------<br />

<h2> <a name="character" id="character">Solaufeins Character</a></h2>	
Solaufein ist ein mehrere Jahrhunderte alter Drow, der sich innerlich von den Drowgebr&auml;uchen distanziert hat. Mit den Drowhierarchien hat er sich auf seine Weise arrangiert: Aufgrund seiner festgefahrenen Situation ist er verbittert und lebt seinen Opportunismus im Schutze seiner hohen Stellung als m&auml;nnlicher Kommandeur und durch den Schutz seines Hauses &uuml;ber Sarkasmus und Widerworte gegen&uuml;ber den niederen Weibchen aus. Seine Liebe f&uuml;r Phaere ist seit langem erloschen, er verabscheut sie genauso wie alle anderen Drow, die nach Lolths Gunst streben.<br />
<br />
Das Hauptthema seiner Dialoge ist die starke Umstellung, die es f&uuml;r ihn bedeutet, nun an der Oberfl&auml;che im Sonnenlicht unterwegs zu sein, seine daraus resultierende Blindheit und damit einhergehende Schw&auml;chung, und seine reduzierten magischen F&auml;higkeiten.<br />
<br />
Er schlie&szlig;t Freundschaft mit einem HC, der sich einigerma&szlig;en f&uuml;r ihn interessiert und sich neutral oder gut verh&auml;lt. Misstrauen ihm als Drow gegen&uuml;ber empfindet er als klug.
<br />
<br />
Achtung: Der Freundschaftspfad enth&auml;lt einen Moment, in dem Solaufein sich auf das Gef&uuml;hl "Freundschaft" einstellen muss, und k&ouml;nnte etwas klischeehaft sein.<br />
</div>

<h1><a name="issues" id="issues">Bekannte Probleme</a></h1>
<div class="section">
Nochmal in K&uuml;rze die wichtigsten Tips beim Spielen im 7. GMM zusammengefast:<br />
-In manchen Cutscenes und Traumsequenzen wird Solaufein als 7. Gruppenmitglied ebenfalls dabei sein. Ich habe vor, das in einer späteren Version für die mir bekannten Cutscenes zu beheben.</br>
-Solaufein hat keinen sogenannten "Clear Fog of War"-Effekt, wenn er als 7. Gruppenmitglied mitl&auml;uft. Das hei&szlig;t, dass das Gebiet, in dem er sich befindet, nicht gesehen werden kann und Solaufein so im dunklen Bereich "verloren gehen" kann. Durch ein Zusammenrufen der Gruppe sollte er wieder im sichtbaren Bereich auftauchen, falls dies geschieht. (Der Grund hierf&uuml;r ist, dass die Engine nicht mehr als 8 Kreaturen pro Gebiet mit dieser Eigenschaft h&auml;ndeln kann - darin inbegriffen sind die 6 Gruppenmitglieder und eventuelle Cutscene-Spione.)</br>
-Nach jedem Questereignis und nach dem Wechsel in den 7.GMM nochmal schauen, ob der HC Items aus dem Inventar verloren hat, die wieder vom Boden aufgelesen werden sollten.<br />
-Es ist n&ouml;tig und auch zu empfehlen, nicht-kritische Questitems nicht im Inventar der 7. GM sondern in dem der normalen Gruppenmitglieder zu haben.<br />
-Gegenst&auml;nde im Inventar des 7. GM werden nicht erkannt, das hei&szlig;t Questgeber reagieren, als h&auml;tte die Gruppe den Gegenstand nicht dabei. F&uuml;r meine eigenen NPCs habe ich die modeigenen Questgegenst&auml;nde zwar gr&ouml;&szlig;tenteils &uuml;ber Skript auch in diesem Fall im Inventar des NPC erkennen lassen, aber auch das funktioniert nicht problemlos.</br>
-Questitems aus Beuteln/Nimmervollen Taschen im Inventar des 7. GM nehmen, bevor man die entsprechenden Questgeber anspricht, um den "Absturzbug" zu verindern.<br />
-Speichern, bevor ein 7. GM wieder in die Gruppe aufgenommen werden soll. Sollte das Spiel dann abst&uuml;rzen, den Spielstand neu laden. Damit sollte der Absturz nicht auftreten.<br />
</br>
</div>

<h1><a name="acknow" id="acknow">Danksagungen</a></h1>
<div class="section">
Vielen herzlichen Dank an <strong>Holger Kirste</strong> f&uuml;r die wundersch&ouml;nen Drow-Portraits! Das Default-Portrait kann hier in voller Gr&ouml;&szlig;e angesehen werden: <a href="https://chinasky.artstation.com/">https://chinasky.artstation.com/</a><br /></br>
<br />
<strong>Acifer:</strong> F&uuml;r Graphik des Zaubers "Dunkelheit".</br>
<strong>Annalena:</strong> Viel Interesse und konstruktive Kritik.</br>
<strong>Caedwyr:</strong> Korrekturlesen (English) inklusive weitreichenden Edits, viele Vorschl&auml;ge vor allem f&uuml;r NPC Banter.</br>
<strong>Isewein:</strong> Korrekturlesen (English).</br>
<strong>Knight:</strong> F&uuml;r die Erlaubnis, f&uuml;r die Abilities Feenfeuer und Dunkelheit die Files seines Dunkelelfen-Kits zu verwenden.</br>
<strong>Morywen:</strong> Betatests und konstruktive Kritik.</br> 
<strong>S.:</strong> Betatests, Korrekturlesen und konstruktive Kritik.</br> 
<strong>Scheele & Arcanecoast Team:</strong> Russische Version.</br>
<strong>viader:</strong> Erlaubnis, die von ihm f&uuml;r BGII:EE konvertierten IWDII-Drideranimationen aus seinem Mod Extended Animations verwenden zu d&uuml;rfen.</br> 
<strong>White Agnus:</strong> Viel Codinghilfe.</br> 
</br>
Danke an BioWare, Black Isle und Wizards of the Coast f&uuml;r Baldur's Gate 1, 2 und die Infinity Engine, und BeamDog f&uuml;r das Neuauflegen der Spiele.</br>
Danke ans Kerzenburgforum f&uuml;r das Hosten der Mod und das Bereitstellen von Austauschm&ouml;glichkeiten mit anderen Moddern und Spielern.</br>
Danke an alle Modder die f&uuml;r die IE-Engine Modding Tools entwickelt haben oder gerade pflegen. Ohne w&auml;re diese Modifikation nicht m&ouml;glich gewesen.</br>
Danke an alle, die diese oder meine anderen Modifikationen spielen, und f&uuml;r Euer Feedback welches es mir erm&ouml;glicht, sie zu verbessern. Ohne Euch w&uuml;rd's nicht viel Spa&szlig; machen!</br>
Das meine ich ernst, auch wenn ich diesen Textbaustein in anderen Readmes ebenfalls verwende! :-)</br>
</div>

<h1><a name="tools" id="tools">Verwendete Tools</a></h1>
<div class="section">
      <ul> 
		<li><a href="https://gibberlings3.github.io/iesdp/index.htm">IESDP</a></li>
		<li><a href="http://www.shsforums.net/topic/57564-bamworkshop/">BAM Workshop</a></li>
		<li><a href="http://www.gibberlings3.net/tools/dltcep.php">DLTCEP</a></li>
		<li><a href="https://forums.beamdog.com/discussion/30593/new-versions-of-nearinfinity-available/p1">Near Infinity</a></li>
		<li><a href="http://www.mud-master.com/shadowkeeper/index.html">Shadowkeeper</a></li>
		<li><a href="https://github.com/WeiDUorg/weidu/releases/latest">WeiDU</a></li>
		<li><a href="https://www.audacityteam.org/">Audacity</a></li>
		<li><a href="https://sourceforge.net/projects/cp-converter/">CpConverter</a></li>
		<li><a href="http://tools.stefankueng.com/grepWin.html">grepWin</a></li>
		<li><a href="http://winmerge.org/">WinMerge</a></li>
      </ul>
<h2> <a name="communities" id="communities">Modding Communitys, Tutorials und technische Unterst&uuml;tzung</a></h2>
      <ul> 
		<li><a href="https://www.baldurs-gate.de/index.php">Kerzenburgforum</a></li>
		<li><a href="https://www.gibberlings3.net/">The Gibberlings Three</a></li>
		<li><a href="http://pocketplane.net">Pocket Plane Group</a></li>
		<li><a href="http://www.shsforums.net/">Spellhold Studios</a></li>
      </ul>
<h2> <a name="links" id="links">Weitere Links von verwendeten oder n&ouml;tigen Ressourcen:</a></h2>
      <ul> 
		<li><a href="http://www.shsforums.net/files/category/98-infinity-animations/">Infinity Animations Mod</a></li>
		<li><a href="http://www.shsforums.net/files/file/861-ia-content-002-iwdii-and-unused-bgii-animations/">Link zu den Drinnenanimationen f&uuml;r BGII/BGT (in dieser Mod bereits enthalten)</a></li>
		<li><a href="http://forum.baldursgate.com/discussion/19501/resource-pack-extended-animations/p1">Extended Animations by viader for BGII:EE/EET (included in this mod)</a></li>
		<li><a href="https://baldurs-gate.de/index.php?resources/knights-kits.11/">Knight Kits (WeiDU-Version, ohne Drowkit)</a></li>
		<li><a href="https://chinasky.artstation.com/">Holger Kirste</a><br /></li>
      </ul>
</div>


<h1><a name="credit" id="credit">Copyright and Legal Notice</a></h1>
<div class="section">
Solaufein ist ein BioWare Charakter. Ich habe nichts dagegen, wenn</br>
-Ihr f&uuml;r Euren eigenen NPC Mod NPC-Solaufein-Dialoge schreibt, ohne mit mir Kontakt aufzunehmen. Ich meine damit wirklich nur NPC-Banter. Mein Solaufein verliebt sich nicht in Euren NPC, auch wenn ich Euch glaube, dass Ihr von Eurem NPC begeistert seid. Er verl&auml;sst auch nicht aufgrund eines Konflikts mit Eurem NPC pl&ouml;tzlich von sich aus die Gruppe (wenn Euer NPC ein Problem mit Solaufein hat, darf er oder sie gerne gehen), nur um zwei Beispiele zu nennen.</br>
-Euer NPC auf Inhalte dieser Mod reagiert, wobei ich darum bitte, von direkten Einmischdialogen in meine Moddialoge Abstand zu nehmen.</br>
Bei allen aufgelisteten Punkten gehe ich davon aus, dass Ihr meinem Mod gegen&uuml;ber Respekt zeigt und so fair seid, Solaufein nicht als l&auml;cherlich oder anst&ouml;&szlig;ig / emp&ouml;rend darzustellen (nicht, was &uuml;ber seine Charakterisierung durch BioWare hinausgeht).</br>
</br> 

Wenn Ihr Code aus dieser Mod verwenden wollt, dann nur zu.</br>
</br>

F&uuml;r die Portraits habe ich Holger Kirstes Erlaubnis, diese als Solaufein-Portraits in dieser Mod anzubieten. Ich vermute, dass er nichts dagegen hat, wenn Ihr die Portraits f&uuml;r den privaten Gebrauch anderweitig verwendet. Alle weiterf&uuml;hrenden Verwendungen unterliegen jedoch dem Urheberrecht.</br>
</br>

Ich freue mich nat&uuml;rlich, wenn Ihr mit mir Kontakt aufnehmen wollt, um meine Meinung zu NPC-Solaufein-Dialogen f&uuml;r Euer NPC-Mod zu h&ouml;ren.</br>
</br>

Technische Updates und Bugfixes der Mod sind, sofern ich nicht (mehr) erreichbar sein sollte, gerne willkommen.</br>
</br>


This mod uses changed area graphics and animations from IWDII. I did this because I am not able to create such great area graphics myself. Of course there are great area artists in the modding community who could have created such for me, but I justified it for myself with the thought that it keeps the drider chambers in the same style as BioWare made them, which is how I like it. </br>
Further, I created a soundset from Solaufein's original lines. For this, I extracted some phrases and words, which are now used in, for some, different context.</br>
If there are any objections legally wise, please let me know and I will remove offensive content immediately.</br>
</br>
This mod is unofficial Fan Content permitted under the Fan Content Policy. Not approved/endorsed by Wizards. Portions of the materials used are property of Wizards of the Coast. ©Wizards of the Coast LLC.
This mod is also not developed, supported, or endorsed by BioWare, Black Isle Studios, Interplay Entertainment Corp., Overhaul Games or Beamdog. All other trademarks and copyrights are property of their respective owners.
</div> 

<h1><a name="version" id="version">Versionshistorie</a></h1>
<div class="section">
Version 3:</br>
- Russian version added, by Scheele & Arcanecoast Team.<br />
- Added Solaufein's weapon pips and a note that he comes ill equipped with weapons into the readme.<br />
- Added more notes about playing in 7th party member note to the readme.<br />
- Added globally unique LABELs to support Project Infinity.<br />
- Changed Solaufein's automated level-up scripts: He will only level up to the PC's level if: he joins the first time for SoA/ToB OR he joins after being a 7th party member. No more automatic level-up although he is in party or was separated for a while.</br>
- Container added to Underdark has prefixed name.<br />
- Corrected doubled tra numbers in GAME.tra.<br />
- Typo corrections.<br />
<br />
Version 2.2:</br>
- fixed detection for tipun's subrace mod.<br />
- moved crossmod for subrace mods into 5th component and deactivated drow reply option if subrace mods are detected.<br />
- Updated readme with description of changed 5th component.<br />
<br />
Version 2.1:</br>
- tipun's subrace mod for EE considered for check whether PC is drow.<br />
- fixed install error if subrace mod(s) were detected.<br />
- Solaufein should not start a banter directly after changing into 7th party member mode.<br />
- ToB encounter now considers items in Solaufein's inventory if he is in 7th party member mode.<br />
- scripts of 7th party member mode should not make Solaufein stop his attacks.<br />
- added notes to restrictions of the "7th party member mode" to the readme.<br />
- added Dynamic Install Order Category to .ini<br />
- corrected "fatigue" spell for detection of party rested.<br />
- added check so mod cannot be installed after EET_End.<br />
- added folder libiconv-1.9.2-1-src.7z with iconv licence info<br />
<br />
Version 2.0:</br>
-English version finished.</br>
-NPC banters revised.</br>
-Elhan's geas: Optimized scripting in case there will be other drow NPCs in the future, EE version considers Hexxat's presence as well.</br>
-Drizzt interjection: added possibility to shorten the conversation via reply option.</br>
-Smuggler encounter tweaked a little. Smuggler will recognize any drow items in group's possession.</br>
-splitted component "Install additional Detection for Drow PC" from the main component.</br>
-Scripting of 7th party member mode improved.</br>
-Fixed small default portrait for classic engine.</br>
-Download link in ini changed to GitHub.</br>
-Changed readme to html.</br>
-Crossmod content for Eilistraee's Song mod added.</br>
<br />
Version 1.6:</br>
-fatesp summoning: transition to correct state </br>
-Spell Darkness: corrected BAM display (should be real sphere of darkness), by Acifer</br>
-Change into 7th party member mode and back should not be interrupted.</br>
-all lines from script traify-ed.</br>
-not getting hostile if hit with friendly fire while in 7th party mode </br>
-C#5MINHP.spl should not be applied to party</br>
<br />
Version 1.5:</br>
-if interacting with the drider cocoons, texts will also be shown on screen (changed to DisplayStringHead)</br>
-added more variable parameters to EET EET_NPC_TRANSITION (tp2 optimization, no changes ingame) </br>
-added summoning for new ToB game (EET)</br>
-crossmod with Ajantis and Gavin moved into Crossmod Banter Pack</br>
-corrected: infer_charset -> infer_charsets</br>
-EE use pvrz-tis (no more black lines in areas)</br>
-setup-c#solaufein.tp2 renamed to c#solaufein.tp2</br>
-c#solaufein.ini with mod info metadata added.</br>
<br />
Version 1.4:</br>
-Solaufein should always change into the 7th party modus without problems (added SetInterrupt(FALSE/TRUE) to script actions).</br>
-update to weidu 246</br>
</br>
Version 1.3:</br>
-integrated proof-readings from Isewein (all files except c#solatra.tra)</br>
-some more lines translated to English</br>
-update to weidu 245</br>
</br>
Version 1.2:</br>
-changed detection of installed Ajantis BGII mod to a dlg-file to reflect behavior of FILE_EXISTS_IN_GAME</br>
-changed WEIGHT of crossmod banters in the hopes that they will mix better with the existent ones (instead of firing all first).</br>
-edited Ajantis crossmod a little</br>
-adjusted trigger for one of the Ajantis-Solaufein banters (dialogue about belt will not trigger if Ajantis got rid of it alone)</br>
-some more lines translated to English</br>
-added link to artstation to portrait artist's page (Holger Kirste)</br>
-added check whether Player1 was rested (baldur.bcs, baldur25.bcs) using spell "C#FATIG1" that gives Player1 1 point to "FATIGUE" if it is "0" -> same principle as Zed Nocear's rest check for BG1. This is for rare cases that a mod uses a cutscene with Rest() instead of PartyRested(), so 7th party member will be rested, too.</br>
</br>
Version 1.1:</br>
-fixed Gavin crossmod install error</br>
</br>
Version 1:</br>
-official release with German and part-English version</br>

<br />
</div>

</body>